
food_stalls = {
	'Pizza Hut': {
		'keywords': ['Pizza Hut', '披薩'],
		'menu': {},
		'minimum_charge': 0 
	},
	'金牌炸食燒烤滷味': {
		'keywords': ['金牌', '金牌炸滷烤', '金牌炸食燒烤滷味'],
		'menu': {
			'香雞排': 50,
			'鹽酥雞': 50,
			'麥克雞塊': 20,
			'脆皮肥腸': 100,
			'鹹酥溪蝦': 50,
			'柳葉魚': 50,
			'魷魚圈': 50,
			'蝦片': 30,
			'蝦捲': 20 
		},
		'minimum_charge': 500 
	},
	'肯德基': {
		'keywords': ['肯德基', '肯基基', 'KFC'],
		'menu': {},
		'minimum_charge': 0 

	},
	'胖老爹': {
		'keywords': ['胖老爹'],
		'menu': {
			'紐奧良香雞排': 60,
			'無骨雞腿排': 70,
			'雞腿': 40,
			'雞塊': 40,
			'雞翅': 25,
			'胖雞丁': 45,
			'泰式胖雞丁': 55,
			'泰式雞排': 70,
			'泰式無骨雞腿排': 80,
			'泰式雞翅': 119
		},
		'minimum_charge': 300
	}
}